dck982/coffeeflow/firmware/screen-lcd-test/sdkconfig.defaults
# Défauts de projet — bring-up LCD jetable (Waveshare ESP32-S3-Touch-LCD-4.3,
# flash 16 Mo, 8 Mo PSRAM). Complète, ne remplace pas, la config par défaut
# d'ESP-IDF v6.1.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Même table que l'écran : contrôle la taille contre un slot OTA de 3500 KiB,
# pas contre la partition factory de 1 MiB du défaut ESP-IDF.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM 8 Mo, nécessaire pour le framebuffer RGB 800x480 (LVGL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL : police montserrat par défaut, juste pour le "Hello world".
CONFIG_LV_FONT_MONTSERRAT_20=y

# Séquence de production réduite : LCD/LVGL avant radio.
CONFIG_LCD_TEST_LCD_WIFI_NIMBLE=y
# CONFIG_LCD_TEST_LCD_ONLY is not set
# CONFIG_LCD_TEST_LCD_WIFI is not set
# CONFIG_LCD_TEST_LCD_NIMBLE is not set
# CONFIG_LCD_TEST_SWITCH_WIFI_NIMBLE is not set

# Même configuration minimale que le client Acaia envisagé : une seule
# connexion centrale, sans serveur ni sécurité, et ses allocations en PSRAM.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=n
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_SERVER=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
# Le test est un client central sans appairage : ne pas générer une IRK de
# confidentialité que NimBLE ne peut (et ne doit) pas persister en NVS.
CONFIG_BT_NIMBLE_HS_PVCY=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=15
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23

CONFIG_ESP_TASK_WDT_EN=y

# Console série normale (pas de contrainte CONFIG_ESP_CONSOLE_NONE ici : ce
# projet n'a ni pont série, ni UART2 réaffecté — voir firmware/screen pour ce
# cas, absent de ce projet jetable).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
